IdeaRS.Connections
BasePlateData.ShearLugWebsWeld Property
Compatible with IDEA StatiCa 0.0
 Gets or sets the properties of the weld between the base plate and shear lug
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public WeldData ShearLugWebsWeld { get; set; }
Property Value
Type: WeldData
See Also
Reference
BasePlateData Class
IdeaRS.Connections.Data Namespace